eboxmaker/eBox_Framework/mcuLib/N32G030/n32g030_std_periph_driver/src/n32g030_rcc.c
/*****************************************************************************
 * Copyright (c) 2019, Nations Technologies Inc.
 *
 * All rights reserved.
 * ****************************************************************************
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * - Redistributions of source code must retain the above copyright notice,
 * this list of conditions and the disclaimer below.
 *
 * Nations' name may not be used to endorse or promote products derived from
 * this software without specific prior written permission.
 *
 * DISCLAIMER: THIS SOFTWARE IS PROVIDED BY NATIONS "AS IS" AND ANY EXPRESS OR
 * IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE
 * DISCLAIMED. IN NO EVENT SHALL NATIONS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
 * LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA,
 * OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF
 * LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING
 * NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 * ****************************************************************************/

/**
 * @file n32g030_rcc.c
 * @author Nations
 * @version v1.0.0
 *
 * @copyright Copyright (c) 2019, Nations Technologies Inc. All rights reserved.
 */
#include "n32g030_rcc.h"

/** @addtogroup n32g030_StdPeriph_Driver
 * @{
 */

/** @addtogroup RCC
 * @brief RCC driver modules
 * @{
 */

/** @addtogroup RCC_Private_TypesDefinitions
 * @{
 */

/**
 * @}
 */

/** @addtogroup RCC_Private_Defines
 * @{
 */

/* ---------------------- RCC registers bit mask ------------------------ */

/* CTRL register bit mask */
#define CTRL_PLLEN_RESET    ((uint32_t)0xFEFFFFFF)
#define CTRL_PLLEN_SET      ((uint32_t)0x01000000)
#define CTRL_PLLOUTEN_RESET ((uint32_t)0xFF7FFFFF)
#define CTRL_PLLOUTEN_SET   ((uint32_t)0x00800000)
#define CTRL_CLKSSEN_RESET  ((uint32_t)0xFFF7FFFF)
#define CTRL_CLKSSEN_SET    ((uint32_t)0x00080000)
#define CTRL_HSEEN_RESET    ((uint32_t)0xFFFEFFFF)
#define CTRL_HSEEN_SET      ((uint32_t)0x00010000)
#define CTRL_HSEBP_RESET    ((uint32_t)0xFFFBFFFF)
#define CTRL_HSEBP_SET      ((uint32_t)0x00040000)
#define CTRL_HSITRIM_MASK   ((uint32_t)0xFFFFFF07)
#define CTRL_HSIEN_RESET    ((uint32_t)0xFFFFFFFE)
#define CTRL_HSIEN_SET      ((uint32_t)0x00000001)

/* CFG register bit mask */
#define CFG_PLL_MASK ((uint32_t)0xFEC0FFFF)

#define CFG_PLLSRC_MASK         ((uint32_t)0x01000000)
#define CFG_PLLOUTDIV_MASK      ((uint32_t)0x00C00000)
#define CFG_PLLPRE_MASK         ((uint32_t)0x00300000)
#define CFG_PLLMULFCT_MASK      ((uint32_t)0x000F0000)
#define CFG_APB2PRES_RESET_MASK ((uint32_t)0xFFFFC7FF)
#define CFG_APB2PRES_SET_MASK   ((uint32_t)0x00003800)
#define CFG_APB1PRES_RESET_MASK ((uint32_t)0xFFFFF8FF)
#define CFG_APB1PRES_SET_MASK   ((uint32_t)0x00000700)
#define CFG_AHBPRES_RESET_MASK  ((uint32_t)0xFFFFFF0F)
#define CFG_AHBPRES_SET_MASK    ((uint32_t)0x000000F0)
#define CFG_SCLKSTS_MASK        ((uint32_t)0x0000C008)
#define CFG_SCLKSW_MASK         ((uint32_t)0xFFFFFFF8)

/* CLKINT register bit mask */
#define CLKINT_RAMCERRRST_SET_MASK   ((uint32_t)0x00004000)
#define CLKINT_RAMCERRRST_RESET_MASK ((uint32_t)0xFFFFBFFF)

/* LSCTRL register bit mask */
#define LSCTRL_LSIEN_SET_MASK         ((uint32_t)0x00000001)
#define LSCTRL_LSIEN_RESET_MASK       ((uint32_t)0xFFFFFFFE)
#define LSCTRL_LSEEN_SET_MASK         ((uint32_t)0x00000004)
#define LSCTRL_LSEEN_RESET_MASK       ((uint32_t)0xFFFFFFFB)
#define LSCTRL_LSEBP_SET_MASK         ((uint32_t)0x00000010)
#define LSCTRL_LSEBP_RESET_MASK       ((uint32_t)0xFFFFFFEF)
#define LSCTRL_RTCSEL_SET_MASK        ((uint32_t)0x00000060)
#define LSCTRL_RTCSEL_RESET_MASK      ((uint32_t)0xFFFFFF9F)
#define LSCTRL_RTCEN_SET_MASK         ((uint32_t)0x00000080)
#define LSCTRL_RTCEN_RESET_MASK       ((uint32_t)0xFFFFFF7F)
#define LSCTRL_RTCRST_SET_MASK        ((uint32_t)0x00000100)
#define LSCTRL_RTCRST_RESET_MASK      ((uint32_t)0xFFFFFEFF)
#define LSCTRL_LPRUNCLKSEL_SET_MASK   ((uint32_t)0x00000200)
#define LSCTRL_LPRUNCLKSEL_RESET_MASK ((uint32_t)0xFFFFFDFF)

/* CFG2 register bit mask */
#define CFG2_TIM18CLKSEL_SET_MASK   ((uint32_t)0x80000000)
#define CFG2_TIM18CLKSEL_RESET_MASK ((uint32_t)0x7FFFFFFF)

#define CFG2_LPUARTCLK_SET_MASK     ((uint32_t)0x0E000000)
#define CFG2_LPUARTCLK_RESET_MASK   ((uint32_t)0xF1FFFFFF)
#define CFG2_LPTIMCLK_SET_MASK      ((uint32_t)0x00E00000)
#define CFG2_LPTIMCLK_RESET_MASK    ((uint32_t)0xFF1FFFFF)
#define CFG2_ADC1MSEL_SET_MASK      ((uint32_t)0x00000400)
#define CFG2_ADC1MSEL_RESET_MASK    ((uint32_t)0xFFFFFBFF)
#define CFG2_ADC1MPRES_SET_MASK     ((uint32_t)0x0000F800)
#define CFG2_ADC1MPRES_RESET_MASK   ((uint32_t)0xFFFF07FF)
#define CFG2_ADCPLLPRES_SET_MASK    ((uint32_t)0x000001F0)
#define CFG2_ADCPLLPRES_RESET_MASK  ((uint32_t)0xFFFFFE0F)
#define CFG2_ADCHPRES_SET_MASK      ((uint32_t)0x0000000F)
#define CFG2_ADCHPRES_RESET_MASK    ((uint32_t)0xFFFFFFF0)

/* CTRLSTS register bit mask */
#define CSR_RMRSTF_SET ((uint32_t)0x00000001)
#define CSR_RMRSTF_Reset ((uint32_t)0xfeffffff)

/* RCC Flag Mask */
#define FLAG_MASK ((uint8_t)0x1F)

/* CLKINT register(Bits[31:0]) base address */
#define CLKINT_ADDR ((uint32_t)0x40021008)

/* LSCTRL register base address */
#define LSCTRL_ADDR ((uint32_t)0x40021020)

/**
 * @}
 */

/** @addtogroup RCC_Private_Macros
 * @{
 */

/**
 * @}
 */

/** @addtogroup RCC_Private_Variables
 * @{
 */

static const uint8_t s_ApbAhbPresTable[16]     = {0, 0, 0, 0, 1, 2, 3, 4, 1, 2, 3, 4, 6, 7, 8, 9};
static const uint8_t s_AdcHclkPresTable[16]    = {1, 2, 4, 6, 8, 10, 12, 16, 32, 32, 32, 32, 32, 32, 32, 32};
static const uint16_t s_AdcPllClkPresTable[16] = {1, 2, 4, 6, 8, 10, 12, 16, 32, 64, 128, 256, 256, 256, 256, 256};

/**
 * @}
 */

/** @addtogroup RCC_Private_FunctionPrototypes
 * @{
 */

/**
 * @}
 */

