eboxmaker/eBox_Framework/mcuLib/N32G030/n32g030_std_periph_driver/src/n32g030_rcc.c
    /* Select the LPTIM clock source */
    RCC->CFG2 |= RCC_LPTIMCLKSource;
}

/**
 * @brief  Returns the clock source used as LPTIM clock.
 * @return The clock source used as system clock. The returned value can
 *   be one of the following:
 *     - RCC_LPTIMCLK_SRC_APB1:   APB1 used as LPTIM clock
 *     - RCC_LPTIMCLK_SRC_HSI:    HSI used as LPTIM clock
 *     - RCC_LPTIMCLK_SRC_HSE:    HSE used as LPTIM clock
 *     - RCC_LPTIMCLK_SRC_LSI:    LSI used as LPTIM clock
 *     - RCC_LPTIMCLK_SRC_LSE:    LSE used as LPTIM clock
 *     - RCC_LPTIMCLK_SRC_COMP1:  COMP1 used as LPTIM clock
 */
uint32_t RCC_GetLPTIMClkSrc(void)
{
    return ((uint32_t)(RCC->CFG2 & CFG2_LPTIMCLK_SET_MASK));
}

/**
 * @brief  Configures the LPUART clock (LPUARTCLK).
 * @param RCC_LPUARTCLKSource specifies the LPUART clock source.
 *   This parameter can be one of the following values:
 *     @arg RCC_LPUARTCLK_SRC_APB1   APB1 clock selected as LPUART clock
 *     @arg RCC_LPUARTCLK_SRC_SYSCLK SYSCLK selected as LPUART clock
 *     @arg RCC_LPUARTCLK_SRC_HSI    HSI selected as LPUART clock
 *     @arg RCC_LPUARTCLK_SRC_HSE    HSE selected as LPUART clock
 *     @arg RCC_LPUARTCLK_SRC_LSI    LSI selected as LPUART clock
 *     @arg RCC_LPUARTCLK_SRC_LSE    LSE selected as LPUART clock
 */
void RCC_ConfigLPUARTClk(uint32_t RCC_LPUARTCLKSource)
{
    /* Check the parameters */
    assert_param(IS_RCC_LPUART_CLK(RCC_LPUARTCLKSource));

    /* LPUART */
    /* Clear the LPUART1 clock source */
    RCC->CFG2 &= RCC_LPUARTCLK_SRC_MASK;

    /* Select the LPTIM clock source */
    RCC->CFG2 |= (RCC_LPUARTCLKSource << 0x19);
}

/**
 * @brief  Returns the clock source used as LPUART clock.
 * @return The clock source used as system clock. The returned value can
 *   be one of the following:
 *     - RCC_LPUARTCLK_SRC_APB1:   APB1 used as LPUART clock
 *     - RCC_LPUARTCLK_SRC_SYSCLK: SYSCLK used as LPUART clock
 *     - RCC_LPUARTCLK_SRC_HSI:    HSI used as LPUART clock
 *     - RCC_LPUARTCLK_SRC_HSE:    HSE used as LPUART clock
 *     - RCC_LPUARTCLK_SRC_LSI:    LSI used as LPUART clock
 *     - RCC_LPUARTCLK_SRC_LSE:    LSE used as LPUART clock
 */
uint32_t RCC_GetLPUARTClkSrc(void)
{
    /* LPUART */
    return ((uint32_t)((RCC->CFG2 & CFG2_LPUARTCLK_SET_MASK) >> 0x19));
}

/**
 * @brief  Configures the External Low Speed oscillator (LSE).
 * @param RCC_LSE specifies the new state of the LSE.
 *   This parameter can be one of the following values:
 *     @arg RCC_LSE_DISABLE LSE oscillator OFF
 *     @arg RCC_LSE_ENABLE LSE oscillator ON
 *     @arg RCC_LSE_BYPASS LSE oscillator bypassed with external clock
 */
void RCC_ConfigLse(uint8_t RCC_LSE)
{
    /* Check the parameters */
    assert_param(IS_RCC_LSE(RCC_LSE));
    /* Reset LSEEN and LSEBYP bits before configuring the LSE ------------------*/
    *(__IO uint32_t*)LSCTRL_ADDR &= (~(RCC_LSCTRL_LSEEN | RCC_LSCTRL_LSEBP));
    /* Configure LSE (RCC_LSE_DISABLE is already covered by the code section above) */
    switch (RCC_LSE)
    {
        case RCC_LSE_ENABLE:
            /* Set LSEON bit */
            *(__IO uint32_t*)LSCTRL_ADDR |= RCC_LSE_ENABLE;
            break;

        case RCC_LSE_BYPASS:
            /* Set LSEBYP and LSEON bits */
            *(__IO uint32_t*)LSCTRL_ADDR |= (RCC_LSE_BYPASS | RCC_LSE_ENABLE);
            break;

        default:
            break;
    }
}

/**
 * @brief  Enables or disables the Internal Low Speed oscillator (LSI).
 * @note   LSI can not be disabled if the IWDG is running.
 * @param Cmd new state of the LSI. This parameter can be: ENABLE or DISABLE.
 */
void RCC_EnableLsi(FunctionalState Cmd)
{
    /* Check the parameters */
    assert_param(IS_FUNCTIONAL_STATE(Cmd));
  
    if(Cmd == ENABLE)
    {
        /* Set LSIEN bit */
        *(__IO uint32_t*)LSCTRL_ADDR |= LSCTRL_LSIEN_SET_MASK;
    }
    else
    {
        /* Reset PLLEN bit */
        *(__IO uint32_t*)LSCTRL_ADDR &= LSCTRL_LSIEN_RESET_MASK;
    }
}

/**
 * @brief  Configures the RTC clock (RTCCLK).
 * @note   Once the RTC clock is selected it can't be changed unless the LowPower domain is reset.
 * @param RCC_RTCCLKSource specifies the RTC clock source.
 *   This parameter can be one of the following values:
 *     @arg RCC_RTCCLK_SRC_NONE:       No clock selected as RTC clock
 *     @arg RCC_RTCCLK_SRC_LSE:        LSE selected as RTC clock
 *     @arg RCC_RTCCLK_SRC_LSI:        LSI selected as RTC clock
 *     @arg RCC_RTCCLK_SRC_HSE_DIV128: HSE clock divided by 32 selected as RTC clock
 */
void RCC_ConfigRtcClk(uint32_t RCC_RTCCLKSource)
{
    /* Check the parameters */
    assert_param(IS_RCC_RTCCLK_SRC(RCC_RTCCLKSource));

    /* Clear the RTC clock source */
    RCC->LSCTRL &= (~RCC_LSCTRL_RTCSEL);

    /* Select the RTC clock source */
    RCC->LSCTRL |= RCC_RTCCLKSource;
}

/**
 * @brief  Returns the clock source used as RTC clock (RTCCLK).
 * @return The clock source used as system clock. The returned value can
 *   be one of the following:
 *     - RCC_RTCCLK_SRC_NONE:       No clock used as RTC clock (RTCCLK)
 *     - RCC_RTCCLK_SRC_LSE:        LSE used as RTC clock (RTCCLK)
 *     - RCC_RTCCLK_SRC_LSI:        LSI used as RTC clock (RTCCLK)
 *     - RCC_RTCCLK_SRC_HSE_DIV128: HSE clock divided by 128 used as RTC clock (RTCCLK)
 */
uint32_t RCC_GetRTCClkSrc(void)
{
    return ((uint32_t)(RCC->LSCTRL & RCC_LSCTRL_RTCSEL));
}

/**
 * @brief  Enables or disables the RTC clock.
 * @note   This function must be used only after the RTC clock was selected using the RCC_ConfigRtcClk function.
 * @param Cmd new state of the RTC clock. This parameter can be: ENABLE or DISABLE.
 */
void RCC_EnableRtcClk(FunctionalState Cmd)
{
    /* Check the parameters */
    assert_param(IS_FUNCTIONAL_STATE(Cmd));

    if(Cmd == ENABLE)
    {
        /* Set LSIEN bit */
        *(__IO uint32_t*)LSCTRL_ADDR |= LSCTRL_RTCEN_SET_MASK;
    }
    else
    {
        /* Reset PLLEN bit */
        *(__IO uint32_t*)LSCTRL_ADDR &= LSCTRL_RTCEN_RESET_MASK;
    }
}



/**
 * @brief Forces or releases RTC reset.
 * @param Cmd new state of the specified peripheral reset. This parameter can be ENABLE or DISABLE.
 */
void RCC_EnableRTCReset(FunctionalState Cmd)
{
    /* Check the parameters */
    assert_param(IS_FUNCTIONAL_STATE(Cmd));

    if (Cmd != DISABLE)
    {
        RCC->LSCTRL |= LSCTRL_RTCRST_SET_MASK;
    }
    else
    {
        RCC->LSCTRL &= LSCTRL_RTCRST_RESET_MASK;
    }
}

/**
 * @brief  Configures the LPRUN clock.
 * @param RCC_LPRUNCLKSource specifies the LPRUN clock source.
 *   This parameter can be one of the following values:
 *     @arg RCC_LPRUNCLK_SRC_LSI LSI selected as LPRUN clock
 *     @arg RCC_LPRUNCLK_SRC_LSE LSE selected as LPRUN clock
 */
void RCC_ConfigLPRUNClk(uint32_t RCC_LPRUNCLKSource)
{
    /* Check the parameters */
    assert_param(IS_RCC_LPRUNCLK_SRC(RCC_LPRUNCLKSource));

    /* Clear the LPRUN clock source */
    RCC->LSCTRL &= (~RCC_LSCTRL_LPRUNCLKSEL);

    /* Select the LPRUN clock source */
    RCC->LSCTRL |= RCC_LPRUNCLKSource;
}

/**
 * @brief  Returns the clock source used as LPRUN clock.
 * @return The clock source used as system clock. The returned value can
 *   be one of the following:
 *     - RCC_LPRUNCLK_SRC_LSI: LSI used as LPRUN clock
 *     - RCC_LPRUNCLK_SRC_LSE: LSE used as LPRUN clock
 */
uint32_t RCC_GetLPRUNClkSrc(void)
{
    return ((uint32_t)(RCC->LSCTRL & RCC_LSCTRL_LPRUNCLKSEL));
}

/**
 * @brief  Returns the frequencies of different on chip clocks.
 * @param RCC_Clocks pointer to a RCC_ClocksType structure which will hold
 *         the clocks frequencies.
 * @note   The result of this function could be not correct when using
 *         fractional value for HSE crystal.
 */
void RCC_GetClocksFreqValue(RCC_ClocksType* RCC_Clocks)
{
    uint32_t tmp = 0, pllclk = 0, pllmull = 0, pllpre = 0, plloutdiv = 0, pllsource = 0, presc = 0;

    /* Get PLL clock source, PLL Pre-Divider, PLL out div and multiplication factor ----------------------*/
    pllmull   = RCC->CFG & CFG_PLLMULFCT_MASK;
    pllpre    = RCC->CFG & CFG_PLLPRE_MASK;
    plloutdiv = RCC->CFG & CFG_PLLOUTDIV_MASK;
    pllsource = RCC->CFG & CFG_PLLSRC_MASK;

